{
	"1": "What is the pricing summary report for all lineitems shipped as of 1998-09-02?",
	"2": "What is the minimum cost supplier for parts of size 15 in the EUROPE region?",
	"3": "What is the top unshipped order with the highest value for the market segment 'BUILDING' as of 1995-03-15?",
	"4": "How many orders were ordered in Q3 1993 where at least one lineitem was received by the customer later than its committed date?",
	"5": "What is the revenue volume done through local suppliers in the ASIA region in the year 1994?",
	"6": "What would be the revenue increase if discounts between 0.06 and 0.07 were eliminated for quantities less than 24 shipped in 1994?",
	"7": "What was the value of goods shipped between FRANCE and GERMANY in 1995?",
	"8": "What was the market share of BRAZIL in AMERICA for ECONOMY ANODIZED STEEL parts in 1995 and 1996?",
	"9": "What was the highest yearly profit for parts containing the word 'green'?",
	"10": "Who is the top customer in terms of lost revenue for Q4 1993?",
	"11": "What is the most valuable part (in terms of inventory) in GERMANY?",
	"12": "How many high and low priority orders were shipped late by MAIL and SHIP modes in 1994?",
	"13": "What is the distribution of customers by the number of orders they have?",
	"14": "What percentage of revenue in September 1995 was derived from promotional parts?",
	"15": "Who is the top supplier in terms of revenue for Q1 1996?",
	"16": "How many suppliers can supply MEDIUM BRUSHED TIN parts of size 3?",
	"17": "What would be the average yearly gross loss in revenue if orders for quantities less than 20% of the average quantity of Brand#23 MED BOX parts were no longer filled?",
	"18": "Who is the top customer who has made a large quantity order (quantity > 300)?",
	"19": "What is the discounted revenue of certain types of parts shipped by air and delivered in person?",
	"20": "Which supplier in CANADA has an excess of forest colored parts available?",
	"21": "Which supplier from SAUDI ARABIA failed to meet the committed delivery date in orders where they were the only supplier who failed?",
	"22": "For country code 13, how many customers haven't placed orders in 7 years and what's their total account balance?"
}